tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "FelixKratz/formulae"

brew "yabai"
brew "skhd"

cask "arc"
cask "raycast"
cask "docker"
brew "neovim"
cask "kitty"

cask "font-fira-code-nerd-font"
brew "stow"

brew "gnupg"
cask "gpg-suite"

brew "cmake"
brew "emscripten"
brew "node"
brew "java"
brew "boost"
brew "act"
brew "zoxide"
brew "fzf"
brew "shfmt"

brew "starship"
brew "borders"
brew "neofetch"

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "fd"
brew "lsd"
brew "tmux"
brew "tpm"
brew "ripgrep"
brew "bat"
